simulated_browser/app/controllers/movies_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @movie = Movie.new
    @genres = Genre.all

INSERT INTO "movies" ("created_at", "release_year", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-30 20:29:04.968796"], ["release_year", 1980], ["title", "Caddyshack"], ["updated_at", "2014-09-30 20:29:04.968796"]]
SELECT  "genres".* FROM "genres"  WHERE "genres"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    Movie.create!(movie_params.merge(params[:movie].merge(:genres => Genre.find(params[:genres]))))